task1/benchmark/res/static_25_mysql_nocache.txt
$ python3 httperf-plot.py --server ryan.dse.in.tum.de --port 8080 --num-conns 2000  --uri / --method GET --rate 100 --ramp-up 100,15
httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=100 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 20.012 s

Connection rate: 99.9 conn/s (10.0 ms/conn, <=3 concurrent connections)
Connection time [ms]: min 20.8 avg 22.4 max 27.5 median 22.5 stddev 0.6
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 99.9 req/s (10.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 99.6 avg 99.9 max 100.0 stddev 0.2 (4 samples)
Reply time [ms]: response 22.3 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 4.83 system 15.18 (user 24.2% system 75.8% total 100.0%)
Net I/O: 33.6 KB/s (0.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=200 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 10.017 s

Connection rate: 199.7 conn/s (5.0 ms/conn, <=5 concurrent connections)
Connection time [ms]: min 21.0 avg 22.2 max 24.9 median 22.5 stddev 0.5
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 199.7 req/s (5.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 199.2 avg 199.6 max 200.0 stddev 0.6 (2 samples)
Reply time [ms]: response 22.1 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 2.32 system 7.69 (user 23.2% system 76.8% total 100.0%)
Net I/O: 67.1 KB/s (0.5*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=300 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 6.685 s

Connection rate: 299.2 conn/s (3.3 ms/conn, <=8 concurrent connections)
Connection time [ms]: min 21.0 avg 22.1 max 24.6 median 22.5 stddev 0.4
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 299.2 req/s (3.3 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 298.8 avg 298.8 max 298.8 stddev 0.0 (1 samples)
Reply time [ms]: response 22.1 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 1.24 system 5.45 (user 18.5% system 81.5% total 100.0%)
Net I/O: 100.5 KB/s (0.8*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=400 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 5.019 s

Connection rate: 398.5 conn/s (2.5 ms/conn, <=11 concurrent connections)
Connection time [ms]: min 20.9 avg 21.9 max 25.5 median 21.5 stddev 0.4
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 398.5 req/s (2.5 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 398.4 avg 398.4 max 398.4 stddev 0.0 (1 samples)
Reply time [ms]: response 21.8 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.83 system 4.19 (user 16.6% system 83.4% total 100.0%)
Net I/O: 133.9 KB/s (1.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=500 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 4.021 s

Connection rate: 497.4 conn/s (2.0 ms/conn, <=14 concurrent connections)
Connection time [ms]: min 20.6 avg 22.1 max 31.1 median 22.5 stddev 0.7
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 497.4 req/s (2.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 22.0 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.59 system 3.43 (user 14.8% system 85.2% total 100.0%)
Net I/O: 167.1 KB/s (1.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=600 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 3.354 s

Connection rate: 596.2 conn/s (1.7 ms/conn, <=17 concurrent connections)
Connection time [ms]: min 20.7 avg 22.0 max 30.3 median 21.5 stddev 0.8
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 596.2 req/s (1.7 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 21.9 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.44 system 2.92 (user 13.1% system 86.9% total 100.0%)
Net I/O: 200.3 KB/s (1.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=700 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.877 s

Connection rate: 695.1 conn/s (1.4 ms/conn, <=19 concurrent connections)
Connection time [ms]: min 20.8 avg 22.2 max 30.1 median 21.5 stddev 0.8
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 695.1 req/s (1.4 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 22.1 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.32 system 2.56 (user 11.2% system 88.8% total 100.0%)
Net I/O: 233.5 KB/s (1.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=800 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.523 s

Connection rate: 792.7 conn/s (1.3 ms/conn, <=24 concurrent connections)
Connection time [ms]: min 21.1 avg 24.0 max 35.4 median 23.5 stddev 1.2
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 792.7 req/s (1.3 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 24.0 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.25 system 2.27 (user 10.0% system 90.0% total 100.0%)
Net I/O: 266.3 KB/s (2.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=900 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.248 s

Connection rate: 889.5 conn/s (1.1 ms/conn, <=32 concurrent connections)
Connection time [ms]: min 22.1 avg 24.5 max 39.4 median 24.5 stddev 2.0
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 889.5 req/s (1.1 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 24.5 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.22 system 2.03 (user 9.7% system 90.3% total 100.0%)
Net I/O: 298.8 KB/s (2.4*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1000 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.039 s

Connection rate: 981.1 conn/s (1.0 ms/conn, <=50 concurrent connections)
Connection time [ms]: min 22.5 avg 39.0 max 54.6 median 39.5 stddev 5.2
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 981.1 req/s (1.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 39.0 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.12 system 1.92 (user 5.8% system 94.1% total 100.0%)
Net I/O: 329.6 KB/s (2.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1100 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.018 s

Connection rate: 991.2 conn/s (1.0 ms/conn, <=211 concurrent connections)
Connection time [ms]: min 23.8 avg 115.0 max 211.0 median 115.5 stddev 54.1
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 991.2 req/s (1.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 114.9 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.05 system 1.97 (user 2.5% system 97.4% total 99.9%)
Net I/O: 333.0 KB/s (2.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1200 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.071 s

Connection rate: 965.6 conn/s (1.0 ms/conn, <=406 concurrent connections)
Connection time [ms]: min 23.0 avg 211.1 max 407.1 median 206.5 stddev 116.7
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 965.6 req/s (1.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 211.0 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.04 system 2.03 (user 2.1% system 97.9% total 99.9%)
Net I/O: 324.4 KB/s (2.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1300 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 1

Total: connections 2000 requests 2000 replies 2000 test-duration 2.013 s

Connection rate: 993.7 conn/s (1.0 ms/conn, <=491 concurrent connections)
Connection time [ms]: min 23.3 avg 259.0 max 475.9 median 259.5 stddev 134.4
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 993.7 req/s (1.0 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 258.9 transfer 0.0
Reply size [B]: header 273.0 content 0.0 footer 2.0 (total 275.0)
Reply status: 1xx=0 2xx=0 3xx=2000 4xx=0 5xx=0

CPU time [s]: user 0.03 system 1.98 (user 1.7% system 98.3% total 99.9%)
Net I/O: 333.8 KB/s (2.7*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1400 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 2

Total: connections 2000 requests 2000 replies 1999 test-duration 2.418 s

Connection rate: 827.2 conn/s (1.2 ms/conn, <=552 concurrent connections)
Connection time [ms]: min 0.2 avg 286.8 max 1088.3 median 280.5 stddev 179.6
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 827.2 req/s (1.2 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 286.7 transfer 0.0
Reply size [B]: header 270.0 content 3.0 footer 1.0 (total 274.0)
Reply status: 1xx=0 2xx=0 3xx=1955 4xx=0 5xx=44

CPU time [s]: user 0.08 system 2.33 (user 3.4% system 96.6% total 100.0%)
Net I/O: 278.7 KB/s (2.3*10^6 bps)

Errors: total 1 client-timo 0 socket-timo 0 connrefused 0 connreset 1
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

httperf --client=0/1 --server=ryan.dse.in.tum.de --port=8080 --uri=/ --rate=1500 --send-buffer=4096 --recv-buffer=16384 --ssl-protocol=auto --method=GET --num-conns=2000 --num-calls=1
Maximum connect burst length: 5

Total: connections 2000 requests 2000 replies 2000 test-duration 1.338 s

Connection rate: 1494.9 conn/s (0.7 ms/conn, <=430 concurrent connections)
Connection time [ms]: min 4.1 avg 118.4 max 299.6 median 110.5 stddev 92.2
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 1.000

Request rate: 1494.9 req/s (0.7 ms/req)
Request size [B]: 71.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 118.3 transfer 0.0
Reply size [B]: header 290.0 content 1554.0 footer 2.0 (total 1846.0)
Reply status: 1xx=0 2xx=0 3xx=770 4xx=0 5xx=1230

CPU time [s]: user 0.07 system 1.27 (user 5.1% system 94.8% total 99.9%)
Net I/O: 2796.1 KB/s (22.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0